content/post/nfs-over-rdma/logs/rdma_fio_bs32k_iodepth8.log
task1: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=8
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=14046: Sat Jul 20 22:25:16 2024
  read: IOPS=86.7k, BW=2708MiB/s (2840MB/s)(79.4GiB/30001msec)
    slat (nsec): min=1904, max=88977, avg=3185.02, stdev=348.31
    clat (usec): min=54, max=1720, avg=88.78, stdev= 7.22
     lat (usec): min=59, max=1725, avg=91.97, stdev= 7.22
    clat percentiles (usec):
     |  1.00th=[   84],  5.00th=[   87], 10.00th=[   88], 20.00th=[   88],
     | 30.00th=[   88], 40.00th=[   88], 50.00th=[   89], 60.00th=[   89],
     | 70.00th=[   89], 80.00th=[   89], 90.00th=[   92], 95.00th=[   93],
     | 99.00th=[   97], 99.50th=[  115], 99.90th=[  161], 99.95th=[  206],
     | 99.99th=[  310]
   bw (  MiB/s): min= 2698, max= 2712, per=100.00%, avg=2709.18, stdev= 2.84, samples=59
   iops        : min=86358, max=86810, avg=86693.69, stdev=91.01, samples=59
  lat (usec)   : 100=99.15%, 250=0.82%, 500=0.03%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=8.02%, sys=37.54%, ctx=2587588, majf=0, minf=75
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2600188,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=2708MiB/s (2840MB/s), 2708MiB/s-2708MiB/s (2840MB/s-2840MB/s), io=79.4GiB (85.2GB), run=30001-30001msec