content/post/nfs-over-rdma/logs/rdma_fio_bs4k_iodepth16.log
task1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=12575: Sat Jul 20 22:07:55 2024
  read: IOPS=166k, BW=647MiB/s (679MB/s)(19.0GiB/30001msec)
    slat (nsec): min=1066, max=70168, avg=1979.63, stdev=348.70
    clat (usec): min=37, max=3085, avg=94.29, stdev=18.68
     lat (usec): min=46, max=3088, avg=96.27, stdev=18.67
    clat percentiles (usec):
     |  1.00th=[   75],  5.00th=[   80], 10.00th=[   82], 20.00th=[   85],
     | 30.00th=[   87], 40.00th=[   89], 50.00th=[   91], 60.00th=[   94],
     | 70.00th=[   98], 80.00th=[  103], 90.00th=[  112], 95.00th=[  118],
     | 99.00th=[  131], 99.50th=[  145], 99.90th=[  355], 99.95th=[  461],
     | 99.99th=[  627]
   bw (  KiB/s): min=654664, max=682960, per=100.00%, avg=663168.81, stdev=5236.37, samples=59
   iops        : min=163666, max=170740, avg=165792.27, stdev=1309.03, samples=59
  lat (usec)   : 50=0.01%, 100=75.05%, 250=24.80%, 500=0.11%, 750=0.03%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=12.66%, sys=47.18%, ctx=3617082, majf=0, minf=25
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4972167,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=647MiB/s (679MB/s), 647MiB/s-647MiB/s (679MB/s-679MB/s), io=19.0GiB (20.4GB), run=30001-30001msec