content/post/nfs-over-rdma/logs/rdma_fio_bs4k_iodepth8.log
task1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=12489: Sat Jul 20 22:06:53 2024
  read: IOPS=125k, BW=486MiB/s (510MB/s)(14.3GiB/30001msec)
    slat (nsec): min=1012, max=57607, avg=2028.05, stdev=375.02
    clat (usec): min=35, max=1524, avg=61.89, stdev=11.33
     lat (usec): min=41, max=1526, avg=63.92, stdev=11.32
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   52], 10.00th=[   54], 20.00th=[   57],
     | 30.00th=[   59], 40.00th=[   61], 50.00th=[   62], 60.00th=[   64],
     | 70.00th=[   65], 80.00th=[   67], 90.00th=[   70], 95.00th=[   72],
     | 99.00th=[   81], 99.50th=[   99], 99.90th=[  165], 99.95th=[  281],
     | 99.99th=[  486]
   bw (  KiB/s): min=481640, max=508776, per=100.00%, avg=498163.53, stdev=5507.15, samples=59
   iops        : min=120410, max=127194, avg=124540.88, stdev=1376.79, samples=59
  lat (usec)   : 50=2.05%, 100=97.47%, 250=0.42%, 500=0.05%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=10.15%, sys=37.51%, ctx=2902849, majf=0, minf=17
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3736214,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=486MiB/s (510MB/s), 486MiB/s-486MiB/s (510MB/s-510MB/s), io=14.3GiB (15.3GB), run=30001-30001msec