content/post/nfs-over-rdma/logs/rdma_fio_bs512k_iodepth4.log
task1: (g=0): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=4
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=16026: Sat Jul 20 22:48:43 2024
  read: IOPS=5511, BW=2756MiB/s (2889MB/s)(80.7GiB/30001msec)
    slat (usec): min=18, max=419, avg=22.40, stdev= 2.20
    clat (usec): min=395, max=3302, avg=702.96, stdev=14.14
     lat (usec): min=537, max=3324, avg=725.36, stdev=14.35
    clat percentiles (usec):
     |  1.00th=[  701],  5.00th=[  701], 10.00th=[  701], 20.00th=[  701],
     | 30.00th=[  701], 40.00th=[  701], 50.00th=[  701], 60.00th=[  701],
     | 70.00th=[  701], 80.00th=[  701], 90.00th=[  709], 95.00th=[  709],
     | 99.00th=[  709], 99.50th=[  709], 99.90th=[  734], 99.95th=[  750],
     | 99.99th=[  816]
   bw (  MiB/s): min= 2742, max= 2757, per=100.00%, avg=2756.22, stdev= 2.57, samples=59
   iops        : min= 5484, max= 5514, avg=5512.44, stdev= 5.15, samples=59
  lat (usec)   : 500=0.01%, 750=99.95%, 1000=0.04%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=0.57%, sys=13.06%, ctx=165337, majf=0, minf=521
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=165337,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=2756MiB/s (2889MB/s), 2756MiB/s-2756MiB/s (2889MB/s-2889MB/s), io=80.7GiB (86.7GB), run=30001-30001msec