content/post/nfs-over-rdma/logs/rdma_fio_bs64k_iodepth16.log
task1: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=16
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=14652: Sat Jul 20 22:32:24 2024
  read: IOPS=43.8k, BW=2735MiB/s (2868MB/s)(80.1GiB/30001msec)
    slat (nsec): min=3170, max=104769, avg=4975.72, stdev=813.37
    clat (usec): min=103, max=2376, avg=360.25, stdev=21.41
     lat (usec): min=129, max=2380, avg=365.22, stdev=21.40
    clat percentiles (usec):
     |  1.00th=[  355],  5.00th=[  359], 10.00th=[  359], 20.00th=[  359],
     | 30.00th=[  359], 40.00th=[  359], 50.00th=[  359], 60.00th=[  359],
     | 70.00th=[  359], 80.00th=[  363], 90.00th=[  363], 95.00th=[  363],
     | 99.00th=[  363], 99.50th=[  367], 99.90th=[  429], 99.95th=[  881],
     | 99.99th=[ 1352]
   bw (  MiB/s): min= 2718, max= 2739, per=100.00%, avg=2735.43, stdev= 4.75, samples=59
   iops        : min=43500, max=43838, avg=43766.88, stdev=76.08, samples=59
  lat (usec)   : 250=0.01%, 500=99.91%, 750=0.02%, 1000=0.03%
  lat (msec)   : 2=0.04%, 4=0.01%
  cpu          : usr=4.58%, sys=26.96%, ctx=1310575, majf=0, minf=265
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1312774,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=2735MiB/s (2868MB/s), 2735MiB/s-2735MiB/s (2868MB/s-2868MB/s), io=80.1GiB (86.0GB), run=30001-30001msec