content/post/nfs-over-rdma/logs/rdma_fio_bs64k_iodepth3.log
task1: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=3
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=14439: Sat Jul 20 22:29:51 2024
  read: IOPS=37.8k, BW=2361MiB/s (2476MB/s)(69.2GiB/30001msec)
    slat (nsec): min=2974, max=139244, avg=4712.96, stdev=585.57
    clat (usec): min=56, max=1712, avg=74.33, stdev=19.06
     lat (usec): min=67, max=1717, avg=79.04, stdev=19.10
    clat percentiles (usec):
     |  1.00th=[   68],  5.00th=[   72], 10.00th=[   72], 20.00th=[   73],
     | 30.00th=[   73], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   75], 80.00th=[   76], 90.00th=[   77], 95.00th=[   78],
     | 99.00th=[   89], 99.50th=[  106], 99.90th=[  157], 99.95th=[  494],
     | 99.99th=[ 1029]
   bw (  MiB/s): min= 2292, max= 2535, per=100.00%, avg=2361.03, stdev=42.19, samples=59
   iops        : min=36672, max=40566, avg=37776.44, stdev=675.00, samples=59
  lat (usec)   : 100=99.38%, 250=0.56%, 500=0.01%, 750=0.02%, 1000=0.02%
  lat (msec)   : 2=0.01%
  cpu          : usr=3.34%, sys=22.60%, ctx=1130585, majf=0, minf=57
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1133335,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=3

Run status group 0 (all jobs):
   READ: bw=2361MiB/s (2476MB/s), 2361MiB/s-2361MiB/s (2476MB/s-2476MB/s), io=69.2GiB (74.3GB), run=30001-30001msec