content/post/nfs-over-rdma/logs/rdma_fio_bs8k_iodepth16.log
task1: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=13097: Sat Jul 20 22:14:03 2024
  read: IOPS=166k, BW=1298MiB/s (1361MB/s)(38.0GiB/30001msec)
    slat (nsec): min=1169, max=64651, avg=2169.23, stdev=337.50
    clat (usec): min=44, max=3799, avg=93.86, stdev=18.66
     lat (usec): min=48, max=3802, avg=96.03, stdev=18.65
    clat percentiles (usec):
     |  1.00th=[   76],  5.00th=[   80], 10.00th=[   83], 20.00th=[   85],
     | 30.00th=[   87], 40.00th=[   89], 50.00th=[   91], 60.00th=[   93],
     | 70.00th=[   97], 80.00th=[  101], 90.00th=[  110], 95.00th=[  117],
     | 99.00th=[  130], 99.50th=[  147], 99.90th=[  351], 99.95th=[  457],
     | 99.99th=[  619]
   bw (  MiB/s): min= 1271, max= 1323, per=99.98%, avg=1297.60, stdev=11.30, samples=59
   iops        : min=162752, max=169386, avg=166092.34, stdev=1446.48, samples=59
  lat (usec)   : 50=0.01%, 100=77.80%, 250=22.06%, 500=0.11%, 750=0.03%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=12.42%, sys=49.88%, ctx=3369197, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4983911,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1298MiB/s (1361MB/s), 1298MiB/s-1298MiB/s (1361MB/s-1361MB/s), io=38.0GiB (40.8GB), run=30001-30001msec