content/post/nfs-over-rdma/logs/rdma_fio_bs8k_iodepth3.log
task1: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=3
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=12886: Sat Jul 20 22:11:30 2024
  read: IOPS=56.1k, BW=438MiB/s (460MB/s)(12.8GiB/30001msec)
    slat (nsec): min=1143, max=62309, avg=2135.78, stdev=325.85
    clat (usec): min=35, max=2686, avg=50.95, stdev=12.19
     lat (usec): min=38, max=2688, avg=53.09, stdev=12.21
    clat percentiles (usec):
     |  1.00th=[   42],  5.00th=[   46], 10.00th=[   48], 20.00th=[   49],
     | 30.00th=[   50], 40.00th=[   50], 50.00th=[   51], 60.00th=[   51],
     | 70.00th=[   52], 80.00th=[   53], 90.00th=[   55], 95.00th=[   56],
     | 99.00th=[   62], 99.50th=[   72], 99.90th=[  106], 99.95th=[  143],
     | 99.99th=[  676]
   bw (  KiB/s): min=408576, max=477504, per=99.96%, avg=448776.95, stdev=12037.62, samples=59
   iops        : min=51072, max=59688, avg=56097.15, stdev=1504.72, samples=59
  lat (usec)   : 50=39.88%, 100=60.00%, 250=0.10%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=5.18%, sys=17.80%, ctx=1513586, majf=0, minf=15
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1683642,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=3

Run status group 0 (all jobs):
   READ: bw=438MiB/s (460MB/s), 438MiB/s-438MiB/s (460MB/s-460MB/s), io=12.8GiB (13.8GB), run=30001-30001msec